# დავალება 1.
# დაწერეთ პროგრამა, 
# რომელიც მომხმარებელს სთხოვს ტექსტის შეყვანას და თუ შეყვანილი 
# ტექსტი არის პალინდრომი დაბეჭდეთ “შეყვანილი ტექსტი არის პალინდრომი” თუ არა, 
# მაშინ დაბეჭდეთ “შეყვანილი ტექსტი არ არის პალინდრომი” პალინდრომი არის ისეთი ტექსტი, რომელიც მარცხნიდანაც და მარჯვნიდანაც ერთნაირად იკითხება


word = input("enter the word...   ")

is_palindrome = word.find(word[::-1])


if is_palindrome == 0:

    print("შეყვანილი ტექსტი არის პალინდრომი")

else:  print("შეყვანილი ტექსტი არ არის პალინდრომი")



# დავალება 2.
# დაწერეთ პროგრამა, რომელიც მომხმარებელს სთხოვს 
# შეიყვანოს ტექსტი, ტექსტის სიმბოლოები გადაყავს შესაბამის ASCII 
# სტანდარტში და გვიბეჭდავს ამ რიცხვების თანმიმდევრობას


input_text = input("enter text: ")
ascii_codes = [ord(char) for char in input_text]

print("ASCII Codes:", ascii_codes)