# დავალება 1.
# დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მომხმარებლისგან რიცხვს და შემდენ იყენებს while ციკლს,
# რომ რევერსულად დაბეჭდოს რიცხვები 0-მდე, მაგალითად თუ შეიყვანს რიცხვს 4, დაიბეჭდოს 4,3,2,1


num1 = int(input("enter number...."))

x = range(num1, 0, -1)

for n in x:
   
   while True:
      
      print(n)

      break


# დავალება 2.
# დაწერეთ პითონის პროგრამა, რომელიც მიიღებს მუდმივად რიცხვებს. შექმენით საწყისი ცვლადი total_sum = 0, 
# შეამოწმეთ რიცხვი, თუ დადებითია, მხოლოდ მაშინ დაუმატეთ total_sum ცვლადს, ეს პროცესი გაგრძელდეს მანამ, 
# სანამ მომხმარებელი არ შეიყვანს ტექსტს sum, რის შემდეგაც დაიბეჭდება შეყვანილი დადებითი რიცხვების ჯამი

total_sum = 0


while True:
    inp = input("enter number...")
    if inp != "sum":
        total_sum += int(inp)
    else:
        print("total sum is ",total_sum)
        break
# დავალება 3.
# დაწერეთ პითონის პროგრამა, რომელიც შემთხვევითობის პრინციპით აირჩევს რიცხვს ნებისმიერ შუალედში, ასევე შექმენით ცვლადი, 
# რომელიც აღნიშნავს სიცოცხლის რაოდენობას. მომხმარებელს მოთხოვეთ, რომ შეიყვანოს რიცხვი და შეადარეთ შემთხვევითობის პრინციპით არჩეულ რიცხვს, თუ მომხმარებლის მიერ შეყვანილი რიცხვი უფრო მეტია დაბეჭდეთ რომ რიცხვი უფრო მეტია,
# თუ უფრო ნაკლებია დაბეჭდეთ რომ რიცხვი ნაკლებია.
# მოქმედება უნდა გახორციელდეს მანამ, სანამ მომხმარებელი არ გამოიცნობს რიცხვს ან არ ამოეწურება სიცოცხლის რაოდენობა
# გამოიყენეთ else ბლოკი while ციკლთან ერთად
import random

life = 5

rand = random.randint(0, 20)



while True:
   guess = int(input("enter your number... "))
   if guess < rand:
       life -= 1
       print("hight then you guess... life 5/", life )
       
   elif guess > rand:
       life -= 1
       print("low then you guess... life 5/", life)

       if life == 0 :
         print("You lose the game")
         break
       
   else:
       print("you win")
       break
   
  
        