# დავალება 1.

# შექმენით გლობალური ცვლადი int_list = [10,20,30,40] და დაწერეთ პითონის ფუნქცია, რომელიც მიიღებს
# რიცხვს პარამეტრად და გლობალურ int_list სიაში ჩაამატებს პარამეტრად მიღებულ რიცხვს
int_list = [10,20,30,40]

def add_num(num):

    return int_list.append(num)

add_num(8)
print(int_list)


# დავალება 2.
# რეკურსიის გამოყენებით დაწერეთ პითონის ფუნქცია, რომელიც მიიღებს ერთ პარამეტრს number და
# დააბრუნებს ციფრების ჯამს (მაგალითად თუ ფუნქციამ მიიღო რიცხვი 12345, უნდა დააბრუნოს 15. რადგან
# 1+2+3+4+5 უდრის 15-ს )

def func(num):
    if num == 0: 
        return 0
    else: 
        return num % 10 + func(num // 10)
        
print(func(123)) 

# დავალება 3.

# რეკურსიის გამოყენებით დაწერეთ პითონის ფუნქცია, რომელიც მიიღებს პარამეტრად სტრიქონს და
# დააბრუნებს მის შებრუნებულ (revers) სტრიქონს ( მაგალითად input:Hello Output: olleH)

def rec(s):
    if len(s) == 0:
        return s
    else:
        return rec(s[1:]) + s[0]
    
print(rec(input("Enter something...")))


# დავალება 4.

# დაწერეთ რეკურსიული ფუნქცია, დააბრუნებს ფიბონაჩის მიმდევრობას.
# ფიბონაჩის მიმდევრობის თანახმად ყოველი რიცხვი წინა ორი რიცხვის ჯამია
# 0, 1, 1, 2, 3, 5, 8, 13, 21

def fibonaci(n):
    if n == 0:
        return 0
    elif n == 1:
        return 1
    else:
        return fibonaci(n - 1) + fibonaci(n - 2)
    
print(fibonaci(7))

